---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures
source: html/eaa8963c-1976-45bc-0d87-581593dbdeb7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures

Failures about PlanRegion.

## Syntax (C#)
```csharp
public static class PlanRegionFailures
```